'''
Тема вебинара: Типы данных в Python

1. INT - integer (целочисленные значения)
   1,  2,  3,  4,  5
   10, 20, 30, 40, 50
2. FLOAT - числа с плавающей запятой, с плавающей точкой
   1.17, 2.17, 3.567
3. BOOL - True or False, Прадва или Ложь (1 или 0)
4. STR - string (строковый тип данных)
   Строка состоит из набора char элементов (символы).

   a = "Привет мир, 1, 2.3, 5.16734, "№;№;%%;:%:?:?*?*(*()!"№!№"!)_+_"
'''

a = 10
b = 5
c = a + b
print("Результат суммирования:", c)




# TODO: Заметки
## Дата: 22.09.2024