'''
Работа с модулями и пакетами

input - входная информация
output (print) - выходная информация

^С++
fsteram - работа с файлами
iostream - чтение и запись данных
ostream - запись данных

numpy <= работа с аналитическими вычислениями
matplotlib <= математические вычисления и построения диаграмм
sqlalchemy <= для работы с базами данных
pandas <=
seaborn <=
GeoPandas <=

Ссылки на библиотеки:
1. https://numpy.org
2. https://matplotlib.org
3. https://www.sqlalchemy.org

Заметки:
1. Numpy
NumPy - это фундаментальный пакет для научных вычислений на Python.
Это библиотека Python, которая предоставляет объект многомерного массива, различные производные объекты (такие как массивы с масками и матрицы) и набор подпрограмм для быстрых операций с массивами, включая математические, логические, манипулирование формами, сортировку, выбор, ввод-вывод, дискретные преобразования Фурье, основы линейной алгебры, базовые статистические операции, случайное моделирование и многое другое.

2. Matplotlib
Matplotlib — это обширная библиотека для создания статических, анимированных и интерактивных визуализаций на Python.
Matplotlib упрощает простые задачи и делает возможными сложные.

3. SQLAlchemy
SQLAlchemy — это набор инструментов Python для работы с SQL и объектно-реляционный преобразователь, который предоставляет разработчикам приложений все возможности и гибкость SQL.
Он предоставляет полный набор хорошо известных шаблонов сохранения данных корпоративного уровня, разработанных для эффективного и высокопроизводительного доступа к базам данных и адаптированных для простого и понятного языка Python.
'''



# TODO: Заметки
## Преподаватель: Дуплей Максим Игоревич
## Дата: 06.10.2024